neon-smart-studio/W-Link_NeonRTOS_STM32/src/W-Link/Driver/GPIO/Device/GPIO_STM32F3.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>

#include "soc.h"

#include "NeonRTOS.h"

#include "GPIO/GPIO.h"

#ifdef STM32F3

#include "GPIO/Device/GPIO_STM32.h"

#define GPIO_EXTI_NVIC_PRIORITY 5
#define GPIO_EXTI_NVIC_SUB_PRIORITY 0

typedef enum GPIO_EXTI_IRQn{
  GPIO_EXTI_IRQn_0,
  GPIO_EXTI_IRQn_1,
  GPIO_EXTI_IRQn_2,
  GPIO_EXTI_IRQn_3,
  GPIO_EXTI_IRQn_4,
  GPIO_EXTI_IRQn_5_9,
  GPIO_EXTI_IRQn_10_15,
  GPIO_EXTI_IRQn_MAX,
}GPIO_EXTI_IRQn;

typedef enum GPIO_EXTI_Line{
  GPIO_EXTI_Line_0,
  GPIO_EXTI_Line_1,
  GPIO_EXTI_Line_2,
  GPIO_EXTI_Line_3,
  GPIO_EXTI_Line_4,
  GPIO_EXTI_Line_5,
  GPIO_EXTI_Line_6,
  GPIO_EXTI_Line_7,
  GPIO_EXTI_Line_8,
  GPIO_EXTI_Line_9,
  GPIO_EXTI_Line_10,
  GPIO_EXTI_Line_11,
  GPIO_EXTI_Line_12,
  GPIO_EXTI_Line_13,
  GPIO_EXTI_Line_14,
  GPIO_EXTI_Line_15,
  GPIO_EXTI_Line_MAX,
}GPIO_EXTI_Line;

typedef struct GPIO_EXTI_Desc{
    hwGPIO_Int_Pin irq_pin;
    hwGPIO_Interrupt_Mode mode;
    EXTI_HandleTypeDef hexti;
} GPIO_EXTI_Desc;

bool gpio_pin_init_status[hwGPIO_Pin_MAX] = {false};

static hwGPIO_Direction gpio_current_dir[hwGPIO_Pin_MAX] = {hwGPIO_Direction_Input};
static hwGPIO_Pull_Mode gpio_current_mode[hwGPIO_Pin_MAX] = {hwGPIO_Pull_Mode_None};

static bool gpio_exti_enable_status[GPIO_EXTI_IRQn_MAX] = {false};
static GPIO_EXTI_Desc gpio_exti_desc[GPIO_EXTI_Line_MAX] = {0};
static GPIO_Interrupt_Event_Handler gpio_irq_handlers[hwGPIO_Int_Pin_MAX] = {NULL};

bool GPIO_Pin_is_Init(hwGPIO_Pin pin)
{
    if(pin>=hwGPIO_Pin_MAX)
    {
      return false;
    }
    
    return gpio_pin_init_status[pin];
}

void GPIO_Enable_RCC_Clock(GPIO_TypeDef * base)
{
  if(base==GPIOA)
  {
    __HAL_RCC_GPIOA_CLK_ENABLE();
  }
  else if(base==GPIOB)
  {
    __HAL_RCC_GPIOB_CLK_ENABLE();
  }
  else if(base==GPIOC)
  {
    __HAL_RCC_GPIOC_CLK_ENABLE();
  }
#if defined(GPIOD)
  else if(base==GPIOD)
  {
    __HAL_RCC_GPIOD_CLK_ENABLE();
  }
#endif
#if defined(GPIOE)
  else if(base==GPIOE)
  {
    __HAL_RCC_GPIOE_CLK_ENABLE();
  }
#endif
#if defined(GPIOF)
  else if(base==GPIOF)
  {
    __HAL_RCC_GPIOF_CLK_ENABLE();
  }
#endif
#if defined(GPIOG)
  else if(base==GPIOG)
  {
    __HAL_RCC_GPIOG_CLK_ENABLE();
  }
#endif
#if defined(GPIOH)
  else if(base==GPIOH)
  {
    __HAL_RCC_GPIOH_CLK_ENABLE();
  }
#endif
}

void GPIO_Disable_RCC_Clock(GPIO_TypeDef * base)
{
  if(base==GPIOA)
  {
    __HAL_RCC_GPIOA_CLK_DISABLE();
  }
  else if(base==GPIOB)
  {
    __HAL_RCC_GPIOB_CLK_DISABLE();
  }
  else if(base==GPIOC)
  {
    __HAL_RCC_GPIOC_CLK_DISABLE();
  }
#if defined(GPIOD)
  else if(base==GPIOD)
  {
    __HAL_RCC_GPIOD_CLK_DISABLE();
  }
#endif
#if defined(GPIOE)
  else if(base==GPIOE)
  {
    __HAL_RCC_GPIOE_CLK_DISABLE();
  }
#endif
#if defined(GPIOF)
  else if(base==GPIOF)
  {
    __HAL_RCC_GPIOF_CLK_DISABLE();
  }
#endif
#if defined(GPIOG)
  else if(base==GPIOG)
  {
    __HAL_RCC_GPIOG_CLK_DISABLE();
  }
#endif
#if defined(GPIOH)
  else if(base==GPIOH)
  {
    __HAL_RCC_GPIOH_CLK_DISABLE();
  }
#endif
}

static void GPIO_Set_Speed(GPIO_InitTypeDef *gpio)
{
#if defined(GPIO_SPEED_FREQ_VERY_HIGH)
    gpio->Speed = GPIO_SPEED_FREQ_VERY_HIGH;
#elif defined(GPIO_SPEED_FREQ_HIGH)
    gpio->Speed = GPIO_SPEED_FREQ_HIGH;
#elif defined(GPIO_SPEED_FREQ_MEDIUM)
    gpio->Speed = GPIO_SPEED_FREQ_MEDIUM;
#else
    gpio->Speed = GPIO_SPEED_FREQ_LOW;
#endif
}

hwGPIO_OpStatus GPIO_Pin_Init(hwGPIO_Pin pin, hwGPIO_Direction dir, hwGPIO_Pull_Mode pull_mode)
{
    if(pin>=hwGPIO_Pin_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
    
    if(dir>=hwGPIO_Direction_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
    
    if(pull_mode>=hwGPIO_Pull_Mode_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
  
    if(gpio_pin_init_status[pin]==true)
    {
      return hwGPIO_PinConflict;
    }
    
    uint16_t soc_pin = GPIO_Map_Soc_Pin(pin);
    GPIO_TypeDef * soc_base = GPIO_Map_Soc_Base(pin);

    if(soc_pin==0 || soc_base==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
    
    GPIO_Enable_RCC_Clock(soc_base);

    GPIO_InitTypeDef gpio_pin_init = {0};
    gpio_pin_init.Pin = soc_pin;

    switch(dir)
    {
        case hwGPIO_Direction_Input:
            gpio_pin_init.Mode = GPIO_MODE_INPUT;
            switch(pull_mode)
            {
                case hwGPIO_Pull_Mode_None: gpio_pin_init.Pull = GPIO_NOPULL; break;
                case hwGPIO_Pull_Mode_Up: gpio_pin_init.Pull = GPIO_PULLUP; break;
                case hwGPIO_Pull_Mode_Down: gpio_pin_init.Pull = GPIO_PULLDOWN; break;
                case hwGPIO_Pull_Mode_OpenDrain: gpio_pin_init.Pull = GPIO_NOPULL; break;
                default: return hwGPIO_InvalidParameter;
            }
            break;

        case hwGPIO_Direction_Output:
        case hwGPIO_Direction_Output_Only:
            switch(pull_mode)
            {
                case hwGPIO_Pull_Mode_None:
                    gpio_pin_init.Mode = GPIO_MODE_OUTPUT_PP;
                    gpio_pin_init.Pull = GPIO_NOPULL;
                    break;
                case hwGPIO_Pull_Mode_Up:
                    gpio_pin_init.Mode = GPIO_MODE_OUTPUT_PP;
                    gpio_pin_init.Pull = GPIO_PULLUP;
                    break;
                case hwGPIO_Pull_Mode_Down:
                    gpio_pin_init.Mode = GPIO_MODE_OUTPUT_PP;
                    gpio_pin_init.Pull = GPIO_PULLDOWN;
                    break;
                case hwGPIO_Pull_Mode_OpenDrain:
                    gpio_pin_init.Mode = GPIO_MODE_OUTPUT_OD;
                    gpio_pin_init.Pull = GPIO_NOPULL;
                    break;
                default:
                    return hwGPIO_InvalidParameter;
            }
            break;

        default:
            return hwGPIO_InvalidParameter;
    }
    
    GPIO_Set_Speed(&gpio_pin_init);

    HAL_GPIO_Init(soc_base, &gpio_pin_init);

    gpio_current_dir[pin] = dir;
    gpio_current_mode[pin] = pull_mode;
    gpio_pin_init_status[pin] = true;
    
    return hwGPIO_OK;
}

