neon-smart-studio/W-Link_NeonRTOS_STM32/src/W-Link/Driver/GPIO/Device/GPIO_STM32F3.c
    gpio_irq_init.Pull = GPIO_NOPULL;
    gpio_irq_init.Pin = soc_pin;

    HAL_GPIO_Init(soc_base, &gpio_irq_init);
    
    EXTI_ConfigTypeDef cfg = {0};
    GPIO_EXTI_Fill_Config(&cfg, exti_line, exti_port, mode);
    
    gpio_exti_desc[exti_line_idx].irq_pin = irq_pin;
    gpio_exti_desc[exti_line_idx].mode = mode;

    HAL_EXTI_SetConfigLine(&gpio_exti_desc[exti_line_idx].hexti, &cfg);
    
    if(exti_line_idx==GPIO_EXTI_Line_0)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_0]==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_0] = true;
        HAL_NVIC_SetPriority(EXTI0_IRQn, GPIO_EXTI_NVIC_PRIORITY, GPIO_EXTI_NVIC_SUB_PRIORITY);
        HAL_NVIC_EnableIRQ(EXTI0_IRQn);
      }
    }

    if(exti_line_idx==GPIO_EXTI_Line_1)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_1]==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_1] = true;
        HAL_NVIC_SetPriority(EXTI1_IRQn, GPIO_EXTI_NVIC_PRIORITY, GPIO_EXTI_NVIC_SUB_PRIORITY);
        HAL_NVIC_EnableIRQ(EXTI1_IRQn);
      }
    }

    if(exti_line_idx==GPIO_EXTI_Line_2)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_2]==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_2] = true;
        HAL_NVIC_SetPriority(EXTI2_TSC_IRQn, GPIO_EXTI_NVIC_PRIORITY, GPIO_EXTI_NVIC_SUB_PRIORITY);
        HAL_NVIC_EnableIRQ(EXTI2_TSC_IRQn);
      }
    }

    if(exti_line_idx==GPIO_EXTI_Line_3)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_3]==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_3] = true;
        HAL_NVIC_SetPriority(EXTI3_IRQn, GPIO_EXTI_NVIC_PRIORITY, GPIO_EXTI_NVIC_SUB_PRIORITY);
        HAL_NVIC_EnableIRQ(EXTI3_IRQn);
      }
    }

    if(exti_line_idx==GPIO_EXTI_Line_4)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_4]==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_4] = true;
        HAL_NVIC_SetPriority(EXTI4_IRQn, GPIO_EXTI_NVIC_PRIORITY, GPIO_EXTI_NVIC_SUB_PRIORITY);
        HAL_NVIC_EnableIRQ(EXTI4_IRQn);
      }
    }

    if(exti_line_idx>=GPIO_EXTI_Line_5 && exti_line_idx<=GPIO_EXTI_Line_9)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_5_9]==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_5_9] = true;
        HAL_NVIC_SetPriority(EXTI9_5_IRQn, GPIO_EXTI_NVIC_PRIORITY, GPIO_EXTI_NVIC_SUB_PRIORITY);
        HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
      }
    }

    if(exti_line_idx>=GPIO_EXTI_Line_10 && exti_line_idx<=GPIO_EXTI_Line_15)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_10_15]==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_10_15] = true;
        HAL_NVIC_SetPriority(EXTI15_10_IRQn, GPIO_EXTI_NVIC_PRIORITY, GPIO_EXTI_NVIC_SUB_PRIORITY);
        HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
      }
    }

    gpio_pin_init_status[irq_pin] = true;
    
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Interrupt_DeInit(hwGPIO_Int_Pin irq_pin)
{
    if(irq_pin>=hwGPIO_Int_Pin_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
    
    if(gpio_pin_init_status[irq_pin]==false)
    {
        return hwGPIO_OK;
    }
    
    uint16_t soc_pin = GPIO_Int_Map_Soc_Pin(irq_pin);
    GPIO_TypeDef * soc_base = GPIO_Int_Map_Soc_Base(irq_pin);

    if(soc_pin==0 || soc_base==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
    
    uint32_t exti_line = GPIO_Int_Map_Exti_Line(irq_pin);
    GPIO_EXTI_Line exti_line_idx = GPIO_Map_EXTI_Line_Index(exti_line);

    if(exti_line_idx>=GPIO_EXTI_Line_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    gpio_exti_desc[exti_line_idx].irq_pin = hwGPIO_Int_Pin_NC;

    if(exti_line_idx==GPIO_EXTI_Line_0)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_0]==true)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_0] = false;
        HAL_NVIC_DisableIRQ(EXTI0_IRQn);
      }
    }

    if(exti_line_idx==GPIO_EXTI_Line_1)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_1]==true)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_1] = false;
        HAL_NVIC_DisableIRQ(EXTI1_IRQn);
      }
    }

    if(exti_line_idx==GPIO_EXTI_Line_2)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_2]==true)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_2] = false;
        HAL_NVIC_DisableIRQ(EXTI2_TSC_IRQn);
      }
    }

    if(exti_line_idx==GPIO_EXTI_Line_3)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_3]==true)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_3] = false;
        HAL_NVIC_DisableIRQ(EXTI3_IRQn);
      }
    }

    if(exti_line_idx==GPIO_EXTI_Line_4)
    {
      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_4]==true)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_4] = false;
        HAL_NVIC_DisableIRQ(EXTI4_IRQn);
      }
    }

    if(exti_line_idx>=GPIO_EXTI_Line_5 && exti_line_idx<=GPIO_EXTI_Line_9)
    {
      bool irq_5_9_used = false;

      for(GPIO_EXTI_Line idx = GPIO_EXTI_Line_5; idx<=GPIO_EXTI_Line_9; idx++)
      {
        if(gpio_exti_desc[idx].irq_pin!=hwGPIO_Int_Pin_NC)
        {
          irq_5_9_used = true;
          break;
        }
      }

      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_5_9]==true && irq_5_9_used==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_5_9] = false;
        HAL_NVIC_DisableIRQ(EXTI9_5_IRQn);
      }
    }

    if(exti_line_idx>=GPIO_EXTI_Line_10 && exti_line_idx<=GPIO_EXTI_Line_15)
    {
      bool irq_10_15_used = false;

      for(GPIO_EXTI_Line idx = GPIO_EXTI_Line_10; idx<=GPIO_EXTI_Line_15; idx++)
      {
        if(gpio_exti_desc[idx].irq_pin!=hwGPIO_Int_Pin_NC)
        {
          irq_10_15_used = true;
          break;
        }
      }

      if(gpio_exti_enable_status[GPIO_EXTI_IRQn_10_15]==true && irq_10_15_used==false)
      {
        gpio_exti_enable_status[GPIO_EXTI_IRQn_10_15] = false;
        HAL_NVIC_DisableIRQ(EXTI15_10_IRQn);
      }
    }

    HAL_EXTI_ClearConfigLine(&gpio_exti_desc[exti_line_idx].hexti);
    
    HAL_GPIO_DeInit(soc_base, soc_pin);
    
    gpio_pin_init_status[irq_pin] = false;

    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Config_Interrupt_Mode(hwGPIO_Int_Pin irq_pin, hwGPIO_Interrupt_Mode mode)
{
    if(irq_pin>=hwGPIO_Int_Pin_MAX || mode>=hwGPIO_Interrupt_Mode_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    uint32_t exti_port = GPIO_Int_Map_Exti_Port(irq_pin);
    uint32_t exti_line = GPIO_Int_Map_Exti_Line(irq_pin);
    GPIO_EXTI_Line exti_line_idx = GPIO_Map_EXTI_Line_Index(exti_line);

    if(exti_line_idx>=GPIO_EXTI_Line_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    EXTI_ConfigTypeDef cfg = {0};
    GPIO_EXTI_Fill_Config(&cfg, exti_line, exti_port, mode);
    
    gpio_exti_desc[exti_line_idx].mode = mode;

    HAL_EXTI_SetConfigLine(&gpio_exti_desc[exti_line_idx].hexti, &cfg);
    
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Register_Interrupt_Handler(hwGPIO_Int_Pin irq_pin, GPIO_Interrupt_Event_Handler handler)
{
    if(irq_pin>=hwGPIO_Int_Pin_MAX || handler==NULL)
    {
        return hwGPIO_InvalidParameter;
    }
  
