neon-smart-studio/W-Link_NeonRTOS_STM32/src/W-Link/Driver/GPIO/Device/GPIO_STM32F3.c
    gpio_irq_handlers[irq_pin] = handler;

    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Unregister_Interrupt_Handler(hwGPIO_Int_Pin irq_pin)
{
    if(irq_pin>=hwGPIO_Int_Pin_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    gpio_irq_handlers[irq_pin] = NULL;

    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Interrupt_Enable(hwGPIO_Int_Pin irq_pin)
{
    if(irq_pin>=hwGPIO_Int_Pin_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    uint32_t exti_port = GPIO_Int_Map_Exti_Port(irq_pin);
    uint32_t exti_line = GPIO_Int_Map_Exti_Line(irq_pin);
    GPIO_EXTI_Line exti_line_idx = GPIO_Map_EXTI_Line_Index(exti_line);

    if(exti_line_idx>=GPIO_EXTI_Line_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    EXTI_ConfigTypeDef cfg = {0};
    GPIO_EXTI_Fill_Config(&cfg, exti_line, exti_port, gpio_exti_desc[exti_line_idx].mode);
    
    HAL_EXTI_SetConfigLine(&gpio_exti_desc[exti_line_idx].hexti, &cfg);
    
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Interrupt_Disable(hwGPIO_Int_Pin irq_pin)
{
    if(irq_pin>=hwGPIO_Int_Pin_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    uint32_t exti_port = GPIO_Int_Map_Exti_Port(irq_pin);
    uint32_t exti_line = GPIO_Int_Map_Exti_Line(irq_pin);
    GPIO_EXTI_Line exti_line_idx = GPIO_Map_EXTI_Line_Index(exti_line);

    if(exti_line_idx>=GPIO_EXTI_Line_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    EXTI_ConfigTypeDef cfg = {0};
    cfg.Line = exti_line;
    cfg.Mode = EXTI_MODE_INTERRUPT;
    cfg.Trigger = EXTI_TRIGGER_NONE;
    cfg.GPIOSel = exti_port;

    HAL_EXTI_SetConfigLine(&gpio_exti_desc[exti_line_idx].hexti, &cfg);
    
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Interrupt_Pin_Read(hwGPIO_Int_Pin pin, bool* level)
{
    if(pin>=hwGPIO_Int_Pin_MAX || level==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
  
    uint16_t soc_pin = GPIO_Int_Map_Soc_Pin(pin);
    GPIO_TypeDef * soc_base = GPIO_Int_Map_Soc_Base(pin);

    if(soc_pin==0 || soc_base==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
    
    *level = (HAL_GPIO_ReadPin(soc_base, soc_pin)==GPIO_PIN_SET) ? true : false;
    
    return hwGPIO_OK;
}

#endif // STM32F3